{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList_universal"},"/ev",{"temp=":"activeQuests"},"\n","^*Перед собой вы видите полуразрушенное строение.*","\n","ev",{"VAR?":"activeQuests"},"str","^pillage_fathers_safehouse","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"examine_safehouse"},{"->":"0.17"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.17"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"examine_safehouse":[["^*Вероятнее всего, это и есть бывшее убежище от вашего отца, вернее то, что от него осталось...*","\n","ev","str","^Зайти внутрь.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Вы заходите в разрушенное убежище, и перед вами предстаёт мрачная картина утраченного великолепия.","\n","^Стены, когда-то увешанные разноцветными тканями и золотистыми амулетами, теперь истерзаны временем и напоминают о былой славе, что рассыпалась под воздействием неотступного течения дней.","\n","^Торговые полки, которые когда-то были витринами для драгоценных сокровищ и загадочных сувениров, теперь лежат, разбросанные, словно забытые осколки прошлой жизни.","\n","^Полы убежища покрыты тонким слоем пыли и обломками, словно могильным покрывалом, где каждая пылинка – это молчаливый свидетель ушедшей славы.","\n","^Разрушенные полки служат теперь лишь местом для теней и паутины...","\n","^На стене вы замечаете странное восьмиугольное отверстие.","\n","^Вы вспоминаете о кольце, которое досталось вам от отца. Драгоценный камень, украшающий это кольцо, такой же формы, как и отверстие.*","\n",["ev","str","^*Вставить кольцо в отверстие.*","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Вы слышите тихий, почти незаметный щелчок. Осторожно повернув кольцо, вы видите, как в стене открывается спрятанный сейф.","\n","^Внутри вы обнаруживаете письма и множество старых рукописей. Бегло просмотрев содержание рукописей, вы замечаете, что некоторые из них действительно имеют отношение к древнему пророчеству.","\n","^Изучив письма, вы понимаете, что ваш отец действительно заботился о своей семье. Здесь проявляется его глубокая тревога и тоска, вызванные продолжительной разлукой с вами и вашей матерью.","\n","^В каждой фразе этих посланий звучит искреннее беспокойство отца, освещающее его страдания при мысли о том, что ему пришлось расстаться с вами и покинуть домашний очаг...*","\n",["ev","str","^*Собрать рукописи и уйти.*","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Вы аккуратно закрываете сейф и выходите из убежища.","\n","ev","str","^Заметки отца","/str",1,0,{"x()":"place_item","exArgs":3},"pop","/ev","\n","ev","str","^pillage_fathers_safehouse","/str",{"x()":"invoke_dialogue_event_universal","exArgs":1},"pop","/ev","\n","^Теперь вам стала известна спрятанная сторона отца, которую вы никогда не чувствовали...*","\n","end",{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":1}],"generic":[["^*Это строение давно было разграблено, и в нём не осталось ничего полезного.*","\n","ev","str","^Уйти.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^...","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}