{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^headman_trial","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"trial"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"trial":[["^* Вы видите, как перед старейшиной Глоргом собираются рыболюди со всей деревни. Это Флурп созвал их, готовясь начать всеобщее собрание.","\n","^Флурп выкрикивает непонятные лозунги на рыбьем языке, махая во все стороны руками и указывая на Глорга.","\n","^Жители деревни слушают его, сперва недоверчиво, затем с возрастающим интересом. Глорг зеленеет от гнева.","\n","^После долгих пререканий со старейшиной Флурп поворачивается к вам и говорит \"Давай, чшшеловек. Рассскажи, что видел!\"*","\n","ev","str","^*Рассказать о месте проведения ритуалов*","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Все жители деревни слушают вас внимательно. Тем, кто не понимает человеческого языка, шёпотом переводят вашу речь другие.","\n","^Вы рассказываете про ритуальные предметы, найденные вами в Старопрудье. Также вы упоминаете чувство ужаса, возникшее у вас в том месте...","\n","^Флурп достаёт мешок с предметами, принесёнными вами из Старопрудья, и бросает его на землю перед Глоргом. Некоторые жители выражают своё изумление и недовольство гулом и свистом.","\n","^Зеленевший Глорг теперь становится фиолетовым, продолжая кричать что-то на рыболюдском языке.","\n","^После этого Флурп оглашает на двух языках: \"Голосуйте, братья и сёстры! Кто за то, чтобы изгнать этого подлеца из нашей деревни?\"","\n","^Большинство рыболюдей поднимают лапы. Среди них также есть те, кому вы помогли.","\n","^После голосования Флурп объявляет: \"На время я возьму на себя обязанности сстарейшины. Для нашей деревни насступит новая эра процветания!\".","\n","^\"Чшеловек\", Флурп обращается к вам, \"Спасибо за помощь. Ты - настоящий друг. Эта деревня будет благодарна тебе во веки веков.\"","\n","^\"Я не забыл о твоей награде. Зайди ко мне после собрания, я отдам столь нужную тебе реликвию.\"","\n","ev","str","^headman_trial","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","^Люди понемногу расходятся, а обессиленный Глорг остаётся стоять на месте, понурив голову.","\n","end",{"#f":5}]}],{"#f":1}],"generic":[["^* Бывший старейшина деревни бормочет что-то себе под нос*","\n","^Вссё, жжизнь моя сс..закончена. Что теперь мне делать?","\n","^Никому я не нужен, даже жжжабы отвернулиссь от меня.","\n","^Ничего, вы ещё у меня попляшете! Ссс... Со мной осссталасссь мудросссть предков!","\n","^Я вернусссь и вы вссе узнаете, насколько вы ошшиблись во мне!","\n","ev","str","^Уйти","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Вы решаете оставить старика в покое.*","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}