{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^fish_opposition_introduce","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"introduce"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"introduce":[["^Псс! Чшшеловек, подойди! Моё имя - Флурп.","\n","^Я сслышал, о чем вы говорили со сстарейшиной Глоргом!","\n","^Он - ужассный тип, не так ли? Посстоянно кичится славой предков, утопает в сссвоих иллюзиях!","\n","^Наша деревня сейчас в упадке из-за него. Он не разрешшает нормально торговать и ссжигает умных рыб на косстре.","\n","^Чшеловек, помоги мне его свергнуть и сстать ссстаростой этой деревни! Если всё получится, я подарю тебе то, что ты хочешшь.","\n","ev","str","^Хорошо. Я в деле. Ты создаешь впечатление образованного и уравновешенного рыбочеловека.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Нет, я не хочу быть между двух огней. Это ваши дела, сами и разбирайтесь.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Ещщё бы, чшеловек! Почти дессять лет я провёл в обществе людей, а сейчас вернулсся сюда и вижу, во что превратилась наша деревня!","\n","^Моё хладнокровное сердцце не споссобно выдержать такого позора!","\n",{"->":".^.^.^.a"},{"#f":5}],"c-1":["\n","^Подумай ещщё раз, человек! Это твой единсственный шанс получить реликвию. Ессли не свергнуть Глорга, он никогда тебе не даст ей завладеть!","\n","^Ты совершишшшь очень доброе дело, ессли поможешь нам!","\n",{"->":".^.^.^.a"},{"#f":5}]}],{"a":["^Человек, слушшай, что мы должны сделать. В нашшей деревне есть древний обычай - провинившийся глава может быть ссвергнут на общем собрании. Для этого надо заручитьсся поддержкой жителей-рыб.","\n","ev","str","^fish_opposition_introduce","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","^Поговори с разными жителями, сспроси, нужна ли им помощщь. Когда жители будут готовы поддержать насс, возвращайся ко мне.","\n","end",{"#f":1}],"#f":1}],"generic":[["^Что такое, ччеловек?","\n","ev","str","^Я пойду.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Сспокойных вод тебе.","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}