{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^get_directions_from_laura","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"get_directions"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"get_directions":[["^Вот и ты! У меня для тебя важные новости, слушай скорее.","\n","^Я изучила множество старых манускриптов. В своем большинстве ничего подходящего, но в одной книге я нашла упоминание старого пророчества, обрекающего мир на вечный холод.","\n","^На самом деле, в той книге не было много полезного, в основном бессвязные размышления старого учёного.","\n","^Однако примечательно то, что работами автора этой книги... сильно интересовался твой отец!","\n","^Я никогда не понимала, зачем он читает подобные бредни. Однако неужели он знал всё заранее?","\n","^Поэтому у меня есть идея, что делать дальше:","\n","^В деревне Жемчужник когда-то было временное убежище твоего отца. Он хранил там разные записи и книги. Это было давно, и с тех пор убежище было разграблено, но возможно, там осталось что-то полезное для нас.","\n","^Отправляйся туда, поищи любые улики, связанные с пророчеством.","\n","^Ах да, удалось узнать что-то полезное от Марка?","\n","ev","str","^Марк - член тайной организации. Им известно про катастрофу. Реликвии, которые мы собирали до этого, могут быть ключом к предотвращению Катаклизма.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Вот значит как... Получается, раньше нас просто водили за нос, не рассказывая правды?","\n","^Что ж, может быть, так было нужно. Будем надеяться, эта его \"тайная организация\" действительно может нам как-то помочь.","\n","^Ну ладно, тебе пора отправляться в путь. Возвращайся скорее!","\n","end",{"#f":5}]}],{"#f":1}],"generic":[["^Привет. Как дела? Удалось узнать что-то новое?","\n","ev","str","^Я работаю над этим. Мне пора идти.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Удачи!","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}