{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^chain_give_amulet","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"give_item"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"give_item":[["^Эй ты, крестьянин! Узри силу моего волшебства!","\n","^Я – самый умелый маг в этом королевстве! Меня зовут Темнейший Лорд! Феноменальная, безграничная мощь!","\n","^*Маг неуверенно делает руками странные движения, как будто распутывая клубок невидимых ниток*","\n","ev","str","^Ты ещё новичок в мире магии, ведь так?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Лучше я пойду, чтобы не злить тебя.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Аргх… Как ты смеешь так говорить? Магия у меня в крови! Папа… то есть мой наставник говорит, что мне нужно попрактиковаться над техникой.","\n","^Немного времени, и все склонятся перед моей волей!","\n","^Знаешь ли ты, крестьянин? Недавно у меня даже получилось применить магию телепортации! Я отправил свой амулет на большое расстояние отсюда.","\n","^Правда, я не знаю, где он сейчас… Слушай, крестьянин, найди мне мой амулет, и тогда сможешь называть себя моим слугой!","\n","ev",{"VAR?":"activeQuests"},"str","^chain_give_amulet","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Вот, держи. Это он?","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.17"},{"c-0":["\n","^Прислужник, у тебя получилось найти мой амулет! Хорошая работа, я подумаю над тем, чтобы произвести тебя в роль своего ассистента.","\n","ev","str","^chain_give_amulet","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","^Темнейший Лорд не забывает доброты. Вот, возьми награду. Надеюсь, этих денег будет достаточно. Теперь иди и расскажи всем о моём благородстве и величии!","\n","end",{"#f":5}]}]}],"nop","\n",["ev","str","^Не то, чтобы мне хотелось быть чьим-то слугой…","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Подумай дважды, простой смертный. У меня не будет отбоя от фанатов, когда я стану самым великим! Потом будет уже поздно!","\n","end",{"#f":5}]}],{"#f":5}],"c-1":["\n","^Правильно! Признай мою силу и беги в страхе! Я – самый великий маг, что когда-либо жил в этом королевстве, нет, во всём мире!","\n","end",{"#f":5}]}],{"#f":1}],"generic":["^Ага! Ты вернулся! Ну что, готов узреть мою силу? Ха-ха-ха-ха-ха!","\n","end",{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}