{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^ask_oldmage_about_new_relic","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"bargain_about_relic"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"bargain_about_relic":[["ev","str","^Я слышал, что у тебя есть одна редкая реликвия. Ты можешь поделиться ей со мной?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Ах, молодой человек, не каждый день кто-то приходит в мою лавку с подобной просьбой. Магические реликвии - это не игрушки для каждого, знаешь ли?","\n",["ev","str","^Но ведь именно поэтому я и пришел! Я уверен, у тебя есть по-настоящему удивительные вещи.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Я понимаю, что это ценные вещи, но мне действительно нужна помощь. Могу я рассчитывать на твою поддержку?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.^.^.^.a"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.^.a"},{"#f":5}]}],{"#f":5}]}],{"a":[["^Что ж, видимо ты не просто случайный посетитель. Но, знаешь ли, я всю жизнь коллекционирую магические реликвии - для меня это нечто особенное.","\n","^Почему бы не поговорить об этом подробнее?","\n","ev","str","^Я всегда готов услышать истории о магии и таинственных предметах. Расскажи мне, пожалуйста!","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Хорошо, я слушаю. Но пожалуйста, давай сразу к сути. У меня нет времени на долгие разговоры.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.^.^.longExplanation"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.shortExplanation"},{"#f":5}]}],{"#f":1}],"longExplanation":["^Каждая из этих реликвий обладает своей собственной историей и магической силой. Некоторые из них так древни, что их происхождение погружено в самые глубины времени.","\n","^Эти реликвии - не просто предметы, они несут в себе древнюю магию, таинственную и могущественную. Люди часто забывают о том, как велика магия вокруг нас.","\n","^Реликвии могут стать твоим верным спутником в путешествиях, раскрывая перед тобой тайны, о которых ты даже не мечтал.","\n","^Но, как и с любой великой вещью, с ними нужно обращаться осторожно.","\n",{"->":".^.^.shortExplanation"},{"#f":1}],"shortExplanation":[["^Эх, нынче молодежь стала забывать о величии наших предков... Все стремятся обрести силу, но никто не задумывается, откуда она взялась.","\n","^Ладно уж, у меня действительно есть реликвия, о который ты просишь меня, но она особенная. Я не могу отдать её просто так.","\n","ev","str","^Что же я должен сделать, чтобы получить её?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Я готов обменять эту реликвию на другую, но она находится в магическом лесу, далеко отсюда.","\n",["ev","str","^Магический лес? Звучит увлекательно. Я с радостью отправлюсь туда и принесу тебе реликвию.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Звучит опасно. Но, как я понимаю, других вариантов нет...","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.^.^.^.^.about_forest"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.^.^.about_forest"},{"#f":5}]}],{"#f":5}]}],{"#f":1}],"about_forest":[["^Вот и отлично! Реликвия, которая мне нужна, выглядит как огненный лист с магического дерева.","\n","^Ты найдешь её, просто зайдя в лес. Однако загвоздка заключается в том, что тот лес окружён неким магическим барьером, который никого не пропускает.","\n","^Я дам тебе магический свиток, который должен помочь тебе преодолеть этот барьер. Подойдя к магическому барьеру, просто прочитай заклинание со свитка, держа его в руках.","\n","^Над созданием этого свитка я трудился несколько лет и изучил огромное количество древних книг.","\n","^В итоге мне удалось запечатать в этот свиток частичку магии волшебника, который создал тот барьер.","\n","^...Уж если быть совсем честным с тобой, юноша, я не до конца уверен, сработает ли этот свиток. Что ж, даже если ничего не выйдет, это полезный опыт.","\n","ev","str","^Свиток Альберика","/str",1,0,{"x()":"place_item","exArgs":3},"pop","/ev","\n","ev","str","^ask_oldmage_about_new_relic","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","ev","str","^Не переживай, я сделаю всё, что в моих силах.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Давай сюда свой свиток...","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n",{"->":".^.^.^.^.finalize"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.finalize"},{"#f":5}]}],{"#f":1}],"finalize":["^Ах да, совсем забыл. Магический лес находится в деревне Зарница, это довольно далеко отсюда. Не забудь взять с собой достаточно припасов.","\n","^Что ж, счастливого пути! Да будет твоя дорога безопасной и спокойной.","\n","end",{"#f":1}],"#f":1}],"generic":[["^Добро пожаловать, юный покупатель. Не желаешь взглянуть на мою коллекцию? У меня много интересных магических вещей.","\n","ev","str","^Что у тебя есть интересного?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Спасибо, я пойду","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^О, все мои предметы высочайшего качества! Взгляни, например, на этот магический Нагреватель. Он поможет тебе сохранить тепло даже в самых холодных местах, а также защищает от ледяной магии.","\n","^Если тебе не нравится тепло, у меня есть для тебя Ледяная колба. Она способна охлаждать всё, что находится внутри неё.","\n","^Для тех, кто жаждет, у меня есть Бездонный бокал. Однако помни, что силы природы не поддаются алчности!","\n","^Вся коллекция доступна для тебя, мой юный друг. Выбирай, что тебе по душе.","\n",["ev","str","^Не знаю... Может быть, я подумаю и вернусь позже.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"exit"},{"#f":5}]}],{"#f":5}],"c-1":["\n",{"->":"exit"},{"#f":5}]}],{"#f":1}],"exit":["^Обязательно возвращайся! Я всегда рад покупателям.","\n","end",{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}