{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^bring_relic_to_oldmage","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"bring_relic"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"bring_relic":["^Приветствую, юноша. Как успехи с поиском реликвии?","\n","ev","str","^bring_relic_to_oldmage","/str",{"x()":"has_enough_items","exArgs":1},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev","str","^Вот реликвия из магического леса.","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.10"},{"c-0":["\n","^Невероятно, тебе всё таки удалось её получить! Ну-ка, давай её скорее сюда.","\n","^*Альберик осматривает магический лист с интересом*","\n","^Это поистине уникальная реликвия. Она займет самое видное место в моей коллекции.","\n","^Расскажи же скорей, что ты видел в магическом лесу? Как я понимаю, мой свиток сработал?","\n",["ev","str","^Да, свиток снял барьер. Однако как только я коснулся этого листа, мне открылось видение.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Что ты такое говоришь? Возможно, ты перегрелся на солнце?","\n",["ev","str","^Нет, я серьёзно. Я видел замёрзший мир, и со мной разговаривал какой-то голос. Он предупредил меня о конце света.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Юноша, послушай меня внимательно. Люди проводят десятки лет, чтобы исследовать реликвии. Величайшие маги используют всю свою силу, чтобы достать крохи информации из подобных реликвий.","\n","^У тебя ведь даже нет магических способностей! Я ничего не чувствую, касаясь этого листа. Наверняка ты съел что-то не то, или слишком мало спал.","\n","^Во всей мировой истории не было такого случая, чтобы кому-то доводилось увидеть будущее, коснувшись реликвии. Поэтому со всем уважением, не морочь мне голову. Предоставь разгадывать загадки тем, кто в этом что-то понимает.","\n","^Не волнуйся, я не забыл о твоей награде. Старый Альберик - честный маг, и держит свое слово. Вот реликвия из моей коллекции, о которой ты просил.","\n","ev","str","^Реликвия Альберика","/str",1,0,{"x()":"place_item","exArgs":3},"pop","/ev","\n","ev","str","^bring_relic_to_oldmage","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","^Теперь, мой юный друг, прошу тебя, уходи. Я рад твоей помощи, но мне нужно время, чтобы исследовать эту реликвию.","\n","end",{"#f":5}]}],{"#f":5}]}],{"#f":5}]}]}],[{"->":".^.b"},{"b":["\n","ev","str","^Уйти","/str","/ev",{"*":".^.c-0","flg":4},{"->":".^.^.^.10"},{"c-0":["\n","^...","\n","end",{"#f":5}]}]}],"nop","\n",{"#f":1}],"generic":["^А, это же мой юный друг, любитель приключений! Рад тебя видеть, спасибо что не забываешь старого мага.","\n",{"->":"ask_questions"},{"#f":1}],"ask_questions":[["^Чем я могу тебе помочь?","\n","ev","str","^Расскажи о своей коллекции.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Мне пора идти.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Моя коллекция - воплощение долгих лет поисков и приключений. Как ты уже знаешь, каждая реликвия - кусочек прошлого, запечатанный в стекле времени.","\n","^Реликвии могут быть ключами к забытым знаниям или окнами в древние эпохи.","\n","^Например, вот та реликвия... *Альберик указывает в сторону стеллажа с реликвиями* ...принесла мне знание о затерянной цивилизации, чья мудрость сделала их великими.","\n","^Иногда реликвии несут не только мудрость, но и бремя прошлого. У меня есть одна реликвия, которая вобрала в себя тень забытой войны. Эта реликвия показывает цену, которую приходится платить за магию и могущество.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Береги себя!","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}