{"inkVersion":20,"root":[["\n","ev",{"x()":"get_activeQuestList"},"/ev",{"temp=":"activeQuests"},"\n","ev",{"VAR?":"activeQuests"},"str","^ask_mark_about_his_sources","/str",{"x()":"contains","exArgs":2},"/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"ask_about_sources"},{"->":"0.15"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"generic"},{"->":"0.15"},null]}],"nop","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"ask_about_sources":[["^Приветствую, коллега! Лаура сказала мне, что теперь ты работаешь вместе с нами. Чем я могу быть тебе полезен?","\n","ev","str","^Привет, Марк. Есть важные новости. *Рассказать Марку об увиденном в магическом лесу и о надвигающейся катастрофе*","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^*Марк хмурится и становится очень серьёзным*","\n","^Что же, похоже этот момент действительно настал. Поскольку тебе известно о Катаклизме, я не вижу смысла что-либо от тебя скрывать. Как я понимаю, тебе интересно, откуда я получал информацию об этих реликвиях, которые вы вместе с Лаурой ищете.","\n","^Видишь ли, я являюсь членом секретной организации. Наша организация предпочитает работать из тени, не вмешиваясь в дела простых людей. Однако какое-то время назад до моих начальников дошли известия о том пророчестве, которое тебе удалось увидеть своими глазами.","\n","^Меня прислали сюда, чтобы изучить пророчество и найти способы его остановить.","\n","^Не хочу тебя разочаровывать, но нашей организации известно о пророчестве не намного больше, чем тебе. Единственное, что мы знаем, так это то, что пророчество может быть остановлено с помощью некоторых магических реликвий.","\n","^Это именно те реликвии, которые начинал собирать твой отец, а сейчас ты продолжаешь его дело.","\n","^Нам не известно, где находятся необходимые реликвии, равно как и не известно, как именно они помогут предотвратить катастрофу.","\n","ev","str","^ask_mark_about_his_sources","/str",{"x()":"invoke_dialogue_event","exArgs":1},"pop","/ev","\n","^Увы, но наша организация не обладает достаточным могуществом, чтобы помочь. У нас нет людей, средств и технологий... Так что основную ношу придётся взять на себя вам с Лаурой.","\n",["ev","str","^Я сделаю всё, что в моих силах, Марк. Катаклизм необходимо остановить.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Это тяжелый груз ответственности, я не уверен, что я справлюсь!","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Я рад видеть твою решимость. Судьба целого мира в твоих руках.","\n",{"->":".^.^.^.^.^.spies"},{"#f":5}],"c-1":["\n","^Поверь мне, ты справишься. Я не знаю, где сейчас твой отец, но он бы гордился тобой.","\n",{"->":".^.^.^.^.^.spies"},{"#f":5}]}],{"#f":5}]}],{"spies":[["^Я могу быть полезен чем-то ещё?","\n","ev","str","^На этом всё, спасибо за твою честность. Мне пора возвращаться к Лауре.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","^Удачи! Возвращайся, если тебе понадобится помощь или ответы на вопросы. Я сделаю всё, что в моих силах.","\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"generic":[["^Я могу тебе чем-то помочь?","\n","ev","str","^У меня есть несколько вопросов.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Я пойду.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Ты имеешь право знать всё. Спрашивай, отвечу без утайки.","\n",{"->":"questions"},{"#f":5}],"c-1":["\n","^Удачи в твоих странствиях!","\n","end",{"#f":5}]}],{"#f":1}],"questions":[["^Что ты хочешь узнать?","\n","ev","str","^Расскажи о моём отце.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Расскажи о своей организации.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Зачем действовать в тайне, почему не сообщить всем?","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^Твой отец - один из самых честных людей, что я знаю. Мне очень нравилось работать с ним. Несмотря на то, что он был торговцем, деньги его особо не интересовали. Людей он не обманывал, всегда старался держать свои обещания.","\n","^Несомненно, ты можешь гордиться своим отцом.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Рассказывать особо нечего - это тайная организация, которая не принадлежит никакому государству. Иногда я получаю приказы","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Я - всего лишь член одной ячейки в своей организации. Другие команды взаимодействуют и с государством, и с могущественными людьми.","\n","^Однако всем подряд рассказывать нельзя - враг не дремлет. Охотники за реликвиями тоже активно ищут любые сведения.","\n",{"->":".^.^.^"},{"#f":5}]}],{"#f":1}],"global decl":["ev","/ev","end",null],"#f":1}],"listDefs":{}}